## SQL 마지막 실습(sakila)
* 영화 흥행 가장 많이 이룬 (렌탈 매출 가장 높은) 배우 리스트 뽑고, 매출 순으로 정렬하시오
* revenue_per_film_table

### SUB QUERY 사용
* 영화별 그룹 GROUP BY film
* rental table(어떤 영화인지는 inventory_id에있음)
* film table(film_id, title)
* inventory table(inventory_id, film_id)

In [2]:
import MySQLdb
import pandas as pd

db = MySQLdb.connect(
    "db.fastcamp.us",
    "root",
    "dkstncks",
    "sakila",
    charset='utf8',
)

cursor = db.cursor()

###
1. revenue per film table 만들기

** 1. SQL **
* WHERE

In [4]:
SQL_QUERY = """
        SELECT
            film.film_id,
            film.rental_rate * COUNT(rental.rental_id) AS "revenue"
        FROM
            film,
            inventory,
            rental
        WHERE
            rental.inventory_id = inventory.inventory_id
            AND inventory.film_id = film.film_id
        GROUP BY 1
        ;
"""

pd.read_sql(SQL_QUERY, db).tail()

     film_id  revenue
953      996     6.93
954      997     5.94
955      998     8.91
956      999    50.83
957     1000   154.69

** 2. pandas**

In [5]:
inventory_df = pd.read_sql("SELECT * FROM inventory;", db)
rental_df = pd.read_sql("SELECT * FROM rental;", db)
film_df = pd.read_sql("SELECT * FROM film;", db)

In [6]:
# WHERE ... = JOIN => pd.merge

pd.merge(rental_df, inventory_df, on='inventory_id') # WHERE 1

merged_df = pd.merge(
    film_df,
    pd.merge(rental_df, inventory_df, on='inventory_id'), # WHERE 1
    on="film_id",
)
merged_df.tail()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,...,last_update,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update_x,store_id,last_update_y
16039,1000,ZORRO ARK,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,None,3,4.99,50,18.99,...,2006-02-15 05:03:42,6901,2005-07-12 21:46:33,4574,158,2005-07-16 21:36:33,1,2006-02-15 21:30:53,1,2006-02-15 05:09:17
16040,1000,ZORRO ARK,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,None,3,4.99,50,18.99,...,2006-02-15 05:03:42,8419,2005-07-29 06:54:48,4574,37,2005-08-06 05:02:48,1,2006-02-15 21:30:53,1,2006-02-15 05:09:17
16041,1000,ZORRO ARK,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,None,3,4.99,50,18.99,...,2006-02-15 05:03:42,13236,2005-08-19 16:18:24,4574,267,2005-08-27 17:48:24,2,2006-02-15 21:30:53,1,2006-02-15 05:09:17
16042,1000,ZORRO ARK,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,None,3,4.99,50,18.99,...,2006-02-15 05:03:42,10479,2005-08-01 10:11:25,4580,275,2005-08-06 04:52:25,1,2006-02-15 21:30:53,2,2006-02-15 05:09:17
16043,1000,ZORRO ARK,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,None,3,4.99,50,18.99,...,2006-02-15 05:03:42,15916,2005-08-23 17:56:01,4580,327,2005-08-31 21:49:01,2,2006-02-15 21:30:53,2,2006-02-15 05:09:17

In [7]:
import numpy as np

merged_df.groupby('film_id').agg({'rental_rate' : np.sum})

# groupby된거에서 특정col의 로우를 합친것

         rental_rate
film_id
1              22.77
2              34.93
3              35.88
4              68.77
5              35.88
6              62.79
7              74.85
8              89.82
9              35.88
10            114.77
11             23.76
12             25.74
13             44.91
15             65.78
16             41.86
17             17.82
18             21.78
19             20.79
20             49.90
21            109.78
22             62.79
23             20.79
24             41.86
25             65.78
26             21.78
27             12.87
28             74.85
29             29.90
30             26.91
31            154.69
...              ...
971            89.82
972           109.78
973           154.69
974             5.94
975            47.84
976            22.77
977            35.88
978             8.91
979           149.70
980            79.84
981            20.79
982            22.77
983            26.91
984            26.91
985           109.78
986            53.82
987            47.84
988            44.85
989           124.75
990             7.92
991            47.84
992            13.86
993            59.80
994            64.87
995           114.77
996             6.93
997             5.94
998             8.91
999            50.83
1000          154.69

[958 rows x 1 columns]

### 2. 배우별 총 매출
* actor
* film_actor

** 1. SQL**

In [11]:
SQL_QUERY = """
        SELECT
            film.film_id,
            film.rental_rate * COUNT(rental.rental_id) AS "revenue"
        FROM
            film,
            inventory,
            rental
        WHERE
            rental.inventory_id = inventory.inventory_id
            AND inventory.film_id = film.film_id
        GROUP BY 1
        ;
"""

NEW_SQL_QUERY = """
    SELECT
        actor.actor_id,
        CONCAT(
            actor.first_name,
            " ",
            actor.last_name
        ) "Name",
        SUM(revenue_per_film.revenue)
    FROM
        actor,
        film_actor,
        ({SQL_QUERY}) AS revenue_per_film
    WHERE
        film_actor.actor_id = actor.actor_id
        AND revenue_per_film.film_id = film_actor.film_id
    GROUP BY 1
    ORDER BY 3 DESC
""".format(
    SQL_QUERY=SQL_QUERY.replace(";", ""),
)





pd.read_sql(NEW_SQL_QUERY, db)

     actor_id                Name  SUM(revenue_per_film.revenue)
0         107      GINA DEGENERES                        2469.47
1          60         HENRY BERRY                        1983.88
2         181      MATTHEW CARREY                        1935.22
3          81      SCARLETT DAMON                        1848.28
4         102         WALTER TORN                        1829.60
5          58    CHRISTIAN AKROYD                        1800.48
6         144  ANGELA WITHERSPOON                        1799.46
7          17        HELEN VOIGHT                        1789.43
8         198         MARY KEITEL                        1767.26
9         111   CAMERON ZELLWEGER                        1760.40
10        191     GREGORY GOODING                        1759.77
11        136        ED MANSFIELD                        1759.22
12         90        SEAN GUINESS                        1759.01
13         23       SANDRA KILMER                        1739.96
14         65       ANGELA HUDSON                        1734.26
15         27       JULIA MCQUEEN                        1727.51
16        185      MICHAEL BOLGER                        1721.47
17         66          MARY TANDY                        1709.65
18         83          BEN WILLIS                        1709.49
19        117         RENEE TRACY                        1700.54
20         28       WOODY HOFFMAN                        1670.40
21         21     KIRSTEN PALTROW                        1663.48
22        142          JADA RYDER                        1660.40
23        147         FAY WINSLET                        1655.57
24         13            UMA WOOD                        1647.63
25         41     JODIE DEGENERES                        1640.07
26         92      KIRSTEN AKROYD                        1621.34
27        127       KEVIN GARLAND                        1607.35
28        151     GEOFFREY HESTON                        1603.38
29        105        SIDNEY CROWE                        1579.43
..        ...                 ...                            ...
170        32         TIM HACKMAN                        1000.76
171       190       AUDREY BAILEY                         987.67
172        38        TOM MCKELLEN                         979.25
173       170         MENA HOPPER                         976.44
174        99          JIM MOSTEL                         975.15
175        77    CARY MCCONAUGHEY                         973.57
176        69     KENNETH PALTROW                         969.49
177       164     HUMPHREY WILLIS                         968.06
178        63        CAMERON WRAY                         967.97
179        91   CHRISTOPHER BERRY                         967.29
180       174      MICHAEL BENING                         950.08
181        79         MAE HOFFMAN                         946.73
182        88       KENNETH PESCI                         945.08
183       183       RUSSELL CLOSE                         887.04
184       189          CUBA BIRCH                         875.39
185       180    JEFF SILVERSTONE                         873.75
186       110         SUSAN DAVIS                         866.80
187         9           JOE SWANK                         831.19
188       141         CATE HARRIS                         825.38
189         3            ED CHASE                         819.89
190         1    PENELOPE GUINESS                         813.95
191       178         LISA MONROE                         812.32
192       199       JULIA FAWCETT                         808.45
193       186     JULIA ZELLWEGER                         792.79
194         4      JENNIFER DAVIS                         751.26
195       148           EMILY DEE                         719.84
196        71          ADAM GRANT                         706.19
197        30         SANDRA PECK                         704.13
198        31      SISSY SOBIESKI                         666.65
199        35           JUDY DEAN                         640.45

[200 rows x 3 columns]

In [12]:
print(NEW_SQL_QUERY)

    SELECT
        actor.actor_id,
        CONCAT(
            actor.first_name,
            " ",
            actor.last_name
        ) "Name",
        SUM(revenue_per_film.revenue)
    FROM
        actor,
        film_actor,
        (
        SELECT
            film.film_id,
            film.rental_rate * COUNT(rental.rental_id) AS "revenue"
        FROM
            film,
            inventory,
            rental
        WHERE
            rental.inventory_id = inventory.inventory_id
            AND inventory.film_id = film.film_id
        GROUP BY 1

) AS revenue_per_film
    WHERE
        film_actor.actor_id = actor.actor_id
        AND revenue_per_film.film_id = film_actor.film_id
    GROUP BY 1
    ORDER BY 3 DESC

** 2. pandas**

In [16]:
merged_df.head(2)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,...,last_update,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update_x,store_id,last_update_y
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,...,2006-02-15 05:03:42,361,2005-05-27 07:03:28,6,587,2005-05-31 08:01:28,1,2006-02-15 21:30:53,2,2006-02-15 05:09:17
1,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,...,2006-02-15 05:03:42,3201,2005-06-21 00:30:26,6,597,2005-06-28 03:42:26,1,2006-02-15 21:30:53,2,2006-02-15 05:09:17

In [48]:
# \(back slash기능 코드속에 엔터가능)
revenue_per_film_df = \
    merged_df.groupby('film_id').agg({'rental_rate' : np.sum})
revenue_per_film_df.head(2)

         rental_rate
film_id
1             227.70
2             139.72

In [49]:
# film_id 라는 colunm을 만들자

revenue_per_film_df['film_id'] = revenue_per_film_df.index
revenue_per_film_df.head(5)

         rental_rate  film_id
film_id
1             227.70        1
2             139.72        2
3             179.40        3
4             343.85        4
5             179.40        5

In [50]:
# FROM ...
actor_df = pd.read_sql("SELECT * FROM actor", db)
film_actor_df = pd.read_sql("SELECT * FROM film_actor", db)

In [51]:
# WHERE...

pd.merge(actor_df, film_actor_df, on="actor_id")

pd.merge(
    pd.merge(actor_df, film_actor_df, on="actor_id"),
    revenue_per_film_df,
    on="film_id"
)

,actor_id,first_name,last_name,last_update_x,film_id,last_update_y,rental_rate
0,1,PENELOPE,GUINESS,2006-02-15 04:34:33,1,2006-02-15 05:05:03,227.70
1,10,CHRISTIAN,GABLE,2006-02-15 04:34:33,1,2006-02-15 05:05:03,227.70
2,20,LUCILLE,TRACY,2006-02-15 04:34:33,1,2006-02-15 05:05:03,227.70
3,30,SANDRA,PECK,2006-02-15 04:34:33,1,2006-02-15 05:05:03,227.70
4,40,JOHNNY,CAGE,2006-02-15 04:34:33,1,2006-02-15 05:05:03,227.70
5,53,MENA,TEMPLE,2006-02-15 04:34:33,1,2006-02-15 05:05:03,227.70
6,108,WARREN,NOLTE,2006-02-15 04:34:33,1,2006-02-15 05:05:03,227.70
7,162,OPRAH,KILMER,2006-02-15 04:34:33,1,2006-02-15 05:05:03,227.70
8,188,ROCK,DUKAKIS,2006-02-15 04:34:33,1,2006-02-15 05:05:03,227.70
9,198,MARY,KEITEL,2006-02-15 04:34:33,1,2006-02-15 05:05:03,227.70
10,1,PENELOPE,GUINESS,2006-02-15 04:34:33,23,2006-02-15 05:05:03,103.95
11,4,JENNIFER,DAVIS,2006-02-15 04:34:33,23,2006-02-15 05:05:03,103.95
12,22,ELVIS,MARX,2006-02-15 04:34:33,23,2006-02-15 05:05:03,103.95
13,150,JAYNE,NOLTE,2006-02-15 04:34:33,23,2006-02-15 05:05:03,103.95
14,164,HUMPHREY,WILLIS,2006-02-15 04:34:33,23,2006-02-15 05:05:03,103.95
15,1,PENELOPE,GUINESS,2006-02-15 04:34:33,25,2006-02-15 05:05:03,592.02
16,4,JENNIFER,DAVIS,2006-02-15 04:34:33,25,2006-02-15 05:05:03,592.02
17,7,GRACE,MOSTEL,2006-02-15 04:34:33,25,2006-02-15 05:05:03,592.02
18,47,JULIA,BARRYMORE,2006-02-15 04:34:33,25,2006-02-15 05:05:03,592.02
19,91,CHRISTOPHER,BERRY,2006-02-15 04:34:33,25,2006-02-15 05:05:03,592.02
20,136,ED,MANSFIELD,2006-02-15 04:34:33,25,2006-02-15 05:05:03,592.02
21,166,NICK,DEGENERES,2006-02-15 04:34:33,25,2006-02-15 05:05:03,592.02
22,167,LAURENCE,BULLOCK,2006-02-15 04:34:33,25,2006-02-15 05:05:03,592.02
23,187,RENEE,BALL,2006-02-15 04:34:33,25,2006-02-15 05:05:03,592.02
24,1,PENELOPE,GUINESS,2006-02-15 04:34:33,106,2006-02-15 05:05:03,83.72
25,65,ANGELA,HUDSON,2006-02-15 04:34:33,106,2006-02-15 05:05:03,83.72
26,124,SCARLETT,BENING,2006-02-15 04:34:33,106,2006-02-15 05:05:03,83.72
27,173,ALAN,DREYFUSS,2006-02-15 04:34:33,106,2006-02-15 05:05:03,83.72
28,1,PENELOPE,GUINESS,2006-02-15 04:34:33,140,2006-02-15 05:05:03,39.60
29,20,LUCILLE,TRACY,2006-02-15 04:34:33,140,2006-02-15 05:05:03,39.60
...,...,...,...,...,...,...,...
5216,150,JAYNE,NOLTE,2006-02-15 04:34:33,629,2006-02-15 05:05:03,27.72
5217,147,FAY,WINSLET,2006-02-15 04:34:33,708,2006-02-15 05:05:03,319.36
5218,178,LISA,MONROE,2006-02-15 04:34:33,708,2006-02-15 05:05:03,319.36
5219,190,AUDREY,BAILEY,2006-02-15 04:34:33,708,2006-02-15 05:05:03,319.36
5220,192,JOHN,SUVARI,2006-02-15 04:34:33,708,2006-02-15 05:05:03,319.36
5221,148,EMILY,DEE,2006-02-15 04:34:33,422,2006-02-15 05:05:03,99.80
5222,186,JULIA,ZELLWEGER,2006-02-15 04:34:33,422,2006-02-15 05:05:03,99.80
5223,149,RUSSELL,TEMPLE,2006-02-15 04:34:33,169,2006-02-15 05:05:03,254.15
5224,154,MERYL,GIBSON,2006-02-15 04:34:33,169,2006-02-15 05:05:03,254.15
5225,164,HUMPHREY,WILLIS,2006-02-15 04:34:33,169,2006-02-15 05:05:03,254.15
5226,184,HUMPHREY,GARLAND,2006-02-15 04:34:33,169,2006-02-15 05:05:03,254.15
5227,196,BELA,WALKEN,2006-02-15 04:34:33,169,2006-02-15 05:05:03,254.15
5228,152,BEN,HARRIS,2006-02-15 04:34:33,611,2006-02-15 05:05:03,84.83
5229,154,MERYL,GIBSON,2006-02-15 04:34:33,440,2006-02-15 05:05:03,12.87
5230,155,IAN,TANDY,2006-02-15 04:34:33,1000,2006-02-15 05:05:03,464.07
5231,166,NICK,DEGENERES,2006-02-15 04:34:33,1000,2006-02-15 05:05:03,464.07
5232,178,LISA,MONROE,2006-02-15 04:34:33,1000,2006-02-15 05:05:03,464.07
5233,158,VIVIEN,BASINGER,2006-02-15 04:34:33,102,2006-02-15 05:05:03,89.82
5234,170,MENA,HOPPER,2006-02-15 04:34:33,102,2006-02-15 05:05:03,89.82
5235,188,ROCK,DUKAKIS,2006-02-15 04:34:33,102,2006-02-15 05:05:03,89.82
5236,158,VIVIEN,BASINGER,2006-02-15 04:34:33,581,2006-02-15 05:05:03,11.88
5237,159,LAURA,BRODY,2006-02-15 04:34:33,789,2006-02-15 05:05:03,89.70
5238,164,HUMPHREY,WILLIS,2006-02-15 04:34:33,681,2006-02-15 05:05:03,20.79
5239,166,NICK,DEGENERES,2006-02-15 04:34:33,580,2006-02-15 05:05:03,189.62
5240,184,HUMPHREY,GARLAND,2006-02-15 04:34:33,580,2006-02-15 05:05:03,189.62
5241,174,MICHAEL,BENING,2006-02-15 04:34:33,352,2006-02-15 05:05:03,32.67
5242,193,BURT,TEMPLE,2006-02-15 04:34:33,352,2006-02-15 05:05:03,32.67
5243,194,MERYL,ALLEN,2006-02-15 04:34:33,352,2006-02-15 05:05:03,32.67
5244,197,REESE,WEST,2006-02-15 04:34:33,995,2006-02-15 05:05:03,114.77
5245,198,MARY,KEITEL,2006-02-15 04:34:33,264,2006-02-15 05:05:03,26.91

In [53]:
merged_df = pd.merge(
    pd.merge(actor_df, film_actor_df, on="actor_id"),
    revenue_per_film_df,
    on="film_id"
)

merged_df = merged_df.rename(columns={'rental_rate': 'revenue'})

merged_df.groupby('actor_id').agg({'revenue' : np.sum})

           revenue
actor_id
1          5470.65
2          7685.61
3          5980.94
4          5694.85
5          9636.30
6          6849.18
7         10242.86
8          7796.59
9          4379.50
10         7092.83
11         7302.41
12         8308.82
13         9985.56
14         9541.05
15         8202.92
16         6184.14
17        11627.18
18         6795.52
19         7040.76
20         7011.93
21        11181.20
22         7173.98
23        11847.27
24         7021.99
25         6978.32
26         8858.05
27        11780.26
28        12022.98
29         8649.40
30         4430.71
...            ...
171        9107.32
172        8205.89
173        8148.83
174        6235.72
175        7506.92
176        8211.48
177       10003.52
178        4357.91
179        8357.18
180        5822.75
181       11976.26
182        6205.68
183        4332.10
184        9000.02
185       10548.74
186        5527.82
187        8253.84
188        9097.07
189        5662.79
190        5453.73
191       12708.86
192        8974.26
193        6495.02
194        7882.83
195        7919.47
196        7088.62
197        9436.34
198       11875.08
199        5378.11
200        6918.46

[200 rows x 1 columns]